In [7]:
import pandas as pd

a=[1,2,3,4]
s1=pd.Series(a)
s1.index=['a','b','c','d']
print(s1)
print(s1.shape)
print(s1.index)
print(s1.values)

a    1
b    2
c    3
d    4
dtype: int64
(4,)
Index(['a', 'b', 'c', 'd'], dtype='object')
[1 2 3 4]

In [8]:
a={'a':10,'b':20,'c':30}
s2=pd.Series(a)
s2

a    10
b    20
c    30
dtype: int64

In [9]:
names=['kim','lee','park','hong','jang']
scores=[85,70,75,90,95]
majors=['컴공','정보통신','경영','컴공','경영']

data={'name':names, 'score':scores, 'major':majors}
df=pd.DataFrame(data)
df

   name  score major
0   kim     85    컴공
1   lee     70  정보통신
2  park     75    경영
3  hong     90    컴공
4  jang     95    경영

In [28]:
data1=[names, scores, majors]
data1

df=pd.DataFrame(data1).T
df.columns=['name','score','major']
# df[['name', 'major']] # 두개 이상의 필드를 선택할때는 [] 하나 더 필요
df['grade']=[1,2,2,1,4]
# df.level=["B","C","C","A","A"]
df['level']=["B","C","C","A","A"]
df

   name score major  grade level
0   kim    85    컴공      1     B
1   lee    70  정보통신      2     C
2  park    75    경영      2     C
3  hong    90    컴공      1     A
4  jang    95    경영      4     A

In [29]:
# 열삭제
# del df['level']
df

   name score major  grade level
0   kim    85    컴공      1     B
1   lee    70  정보통신      2     C
2  park    75    경영      2     C
3  hong    90    컴공      1     A
4  jang    95    경영      4     A

In [31]:
#인덱스 추가
df.index=['a','b','c','d','e']
df['score']
df

   name score major  grade level
a   kim    85    컴공      1     B
b   lee    70  정보통신      2     C
c  park    75    경영      2     C
d  hong    90    컴공      1     A
e  jang    95    경영      4     A

In [41]:
# df.iloc[1:3]
# print(df.iloc[[1,3]])
# print(df.loc['a']) #인덱스으로 이름으로 찾기
# print(df.loc['a':'d','name'])
print(df.loc['a':'d',['name','major']])

   name major
a   kim    컴공
b   lee  정보통신
c  park    경영
d  hong    컴공

In [45]:
print(df)
df.loc[df.major=='컴공',['name','major']]

   name score major  grade level
a   kim    85    컴공      1     B
b   lee    70  정보통신      2     C
c  park    75    경영      2     C
d  hong    90    컴공      1     A
e  jang    95    경영      4     A

   name major
a   kim    컴공
d  hong    컴공

In [53]:
names=['kim','lee','park','hong','jang']
kor=[80,85,95,90,75]
eng=[85,90,100,95,75]
math=[80,75,90,85,80]



data={'name':names, 'kor':kor, 'eng':eng, 'math':math, }
df=pd.DataFrame(data)
df['total']=df.kor+df.eng+df.math
df['avg']=df.total/3
df.index=['a','b','c','d','e']
df

   name  kor  eng  math  total        avg
a   kim   80   85    80    245  81.666667
b   lee   85   90    75    250  83.333333
c  park   95  100    90    285  95.000000
d  hong   90   95    85    270  90.000000
e  jang   75   75    80    230  76.666667

name, kor, eng, math 리스트 값을 사용하여 DateFrame를 작성하시오
total=kor+eng+math
avg=total/3

이름이 lee인 사람의 국어 점수를 검색하라.
평균이 90점 이상인 사람의 이름과 평균을 검색하라.
인덱스를 사용하여 1행~3행까지 이름, total, avg를 검색하라.

In [61]:
print(df.loc[df.name=='lee',['name','kor']])
print(df.loc[df.avg>=90,['name','avg']])
print(df.loc['a':'c',['name','total','avg']])
print(df.iloc[:3,[0,4,5]])

  name  kor
b  lee   85
   name   avg
c  park  95.0
d  hong  90.0
   name  total        avg
a   kim    245  81.666667
b   lee    250  83.333333
c  park    285  95.000000
   name  total        avg
a   kim    245  81.666667
b   lee    250  83.333333
c  park    285  95.000000

In [63]:
df['합격여부'] = [ '합격' if a >= 90 else '불합격' for a in df['avg']]
df

   name  kor  eng  math  total        avg 합격여부
a   kim   80   85    80    245  81.666667  불합격
b   lee   85   90    75    250  83.333333  불합격
c  park   95  100    90    285  95.000000   합격
d  hong   90   95    85    270  90.000000   합격
e  jang   75   75    80    230  76.666667  불합격

In [72]:
# 리스트 컴프리헨션

a=[]
for i in range(0,10,1):
    a.append(i)

print(a)

b=[i for i in range(10)]
print(b)

c=[i for i in range(10) if i%2==1]
print(c)

d=[i if i%2==0 else 0 for i in range(10)]
print(d)

e=[[i*j for j in range(5)] for i in range(10,15)]
print(e)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
[1, 3, 5, 7, 9]
[0, 0, 2, 0, 4, 0, 6, 0, 8, 0]
[[0, 10, 20, 30, 40], [0, 11, 22, 33, 44], [0, 12, 24, 36, 48], [0, 13, 26, 39, 52], [0, 14, 28, 42, 56]]

In [74]:
df.describe()

             kor         eng       math       total        avg
count   5.000000    5.000000   5.000000    5.000000   5.000000
mean   85.000000   89.000000  82.000000  256.000000  85.333333
std     7.905694    9.617692   5.700877   21.621748   7.207249
min    75.000000   75.000000  75.000000  230.000000  76.666667
25%    80.000000   85.000000  80.000000  245.000000  81.666667
50%    85.000000   90.000000  80.000000  250.000000  83.333333
75%    90.000000   95.000000  85.000000  270.000000  90.000000
max    95.000000  100.000000  90.000000  285.000000  95.000000

In [79]:
df.max(axis=0)

name     park
kor        95
eng       100
math       90
total     285
avg      95.0
합격여부       합격
dtype: object

In [ ]:
# python open()함수
# csv 모듈
# pandas 모듈

In [80]:
#python open
infilepath="data/input.csv"
outfilepath='data/output.csv'

In [86]:
#python open
with open(infilepath, 'r',newline='' ) as reader:
    with open(outfilepath, 'w',newline="") as writer:
        header=reader.readline() #위에 한개 라인 읽기
        header=header.strip() #양쪽 끝에 공백 없애기
        header_list=header.split(',') #,를 기준으로 문자를 나누어서 읽기
        print(header)
        # print(type(header_list))

        writer.write(','.join(header_list)+"\n")
        for row in reader:
            row=row.strip()
            row_list=row.split(',')
            print(row_list)
            writer.write(','.join(row_list)+"\n")

Supplier Name,Invoice Number,Part Number,Cost,Purchase Date
['A', '001-1001', '2341', '"$500', '000"', '2014-01-20']
['A', '001-1001', '5467', '500000', '2014-01-20']
['A', '001-1001', '5407', '750000', '2014-01-20']
['A', '001-1001', '2341', '750000', '2014-01-20']
['B', '50-9501', '7009', '250000', '2018-01-30']
['B', '50-9501', '7009', '250000', '2018-01-30']
['B', '50-9505', '6650', '125000', '2017-02-03']
['B', '50-9505', '6650', '125000', '2017-02-03']
['C', '920-4803', '3321', '615000', '2017-02-03']
['C', '920-4804', '3321', '615000', '2017-02-10']
['C', '920-4805', '3321', '615000', '2017-02-17']
['C', '920-4806', '3321', '615000', '2017-02-24']

In [93]:
df=pd.read_csv(infilepath)
# print(df)
df['Cost']=df['Cost'].str.strip('$').str.replace(",","").astype(float)
# print(df)
# df.to_csv("data/output2.csv",index=False)
result=df.loc[(df['Supplier Name']=='A') & (df['Cost']>700000),:]
result
result.to_csv("data/output3.csv",index=False)

Supplier Name이 C이거나 Cost가 250,000 미만인 것을 선택하라. 
Supplier Name별 Cost의 평균을 구하라.

In [95]:
df=pd.read_csv(infilepath)
# print(df)
df['Cost']=df['Cost'].str.strip('$').str.replace(",","").astype(float)
# print(df)
# df.to_csv("data/output2.csv",index=False)
result=df.loc[(df['Supplier Name']=='C') | (df['Cost']<250000),:]
result
result.to_csv("data/output4.csv",index=False)

In [99]:
df=pd.read_csv(infilepath)
# print(df)
df['Cost']=df['Cost'].str.strip('$').str.replace(",","").astype(float)
df2=df[['Supplier Name','Cost']]
result=df2.groupby('Supplier Name').mean()
print(result)

                   Cost
Supplier Name
A              625000.0
B              187500.0
C              615000.0

In [ ]:
#python open, 조건 검색 행만 선택하기
#supplier name이 A이고 cost가 700000이상인 데이터 선택
with open(infilepath, 'r',newline='' ) as reader:
    with open(outfilepath, 'w',newline="") as writer:
        header=reader.readline() #위에 한개 라인 읽기
        header=header.strip() #양쪽 끝에 공백 없애기
        header_list=header.split(',') #,를 기준으로 문자를 나누어서 읽기
        print(header)
        # print(type(header_list))

        writer.write(','.join(header_list)+"\n")
        for row in reader:
            supplier=row[0].strip()
            cost=row[3].strip('$').replace(",","")
            print(cost)

            if supplier=="A" and float(cost)>=700000:
                print(row)
                writer.writerrow(row)

In [83]:
kk=['red','blue','green']
str=','.join(kk)
print(str)

red-blue-green

In [84]:
ll=str.split(',')
print(ll)

['red-blue-green']